#!/usr/bin/env python

import os, fe

rom = fe.rom()

start = fe.cpu_to_prg(0x8E914A)
end = fe.cpu_to_prg(0x8E9213)

chars = [
    'X', 'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ',
    'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま',
    'み', 'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん', 'が',
    'ぎ', 'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び',
    'ぶ', 'べ', 'ぼ', 'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ', 'ゃ', 'っ', 'ゅ',
    'ょ', 'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ',
    'タ', 'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'マ',
    'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ン', 'ガ', 'ギ',
    'グ', 'ゲ', 'ゴ', 'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ', 'ダ', 'ヂ', 'ヅ', 'デ', 'ド', 'バ', 'ビ', 'ブ',
    'ベ', 'ボ', 'パ', 'ピ', 'プ', 'ペ', 'ポ', 'ァ', 'ィ', 'ゥ', 'ェ', 'ォ', 'ャ', 'ッ', 'ュ', 'ョ',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '神', '何', '会', '賊', '大', '男',
    '元', '気', '出', '状', '今', '皇', '帝', '聖', '寺', 'ー', '勇', '者', '？', '苦', '加', '争',
    '「', '」', '（', '）', ' ', '！', '攻', '撃', '力', '守', '備', '魔', '竜', '石', '団', '闘',
    '技', '場', '店', '必', '殺', '一', '道', '書', '杖', '系', 'Ｍ', '星', '話', '兵', '士', '使',
    '用', '運', '速', '法', '軍', '白', '火', '飛', '地', '暗', '黒', '進', '城', '海', '人', '騎',
    '.', '王', '子', '女', '様', '父', '行', '戦', '来', '・', '母', '山', '集', '♥', '剣', '国',
]

buffer = ''
i = start
s = i
while i < end:
    c = rom[i]
    if c == 0x00 and rom[i+1] == 0x83:
        print(f'\nL{fe.prg_to_cpu(s):06X}:')
        print(f'.STRINGMAP script_jp, "{buffer}"')
        print(".db $00 $83")
        buffer = ''
        i += 2
        s = i
    else:
        buffer += chars[c]
        i += 1
